
#Область ОбработкаОсновныхСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.НомерПараметраДляРезультата.Доступность = НЕ Объект.ЭтоФункция;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.НомерПараметраДляРезультата.Доступность = НЕ Объект.ЭтоФункция;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНаКлиенте();

КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.Данные.Количество() Тогда	
		Ответ = Ждать ВопросАсинх("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Ответ = КодВозвратаДиалога.Да
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)        
	
	Если ПроверитьЗаполнение() Тогда
		ЗапуститьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоФункцияПриИзменении(Элемент)
	
	Элементы.НомерПараметраДляРезультата.Доступность = НЕ Объект.ЭтоФункция;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыНаСервере

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.Заполнить();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаКлиенте() 
	
	ЗаполнитьНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.Запустить();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	ЗаполнитьДиаграммуГанта();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуГанта()
	
	ДиаграммаГантаИсполнения.Очистить();
	
	ДиаграммаГантаИсполнения.Обновление = Ложь;
	
	Для Индекс = 1 По Объект.КоличествоПотоков Цикл
		
		Точка = ДиаграммаГантаИсполнения.УстановитьТочку(Индекс);
		
	КонецЦикла;
	
	Серия = ДиаграммаГантаИсполнения.УстановитьСерию("Выполнение");
	
	Для Каждого Строка Из Объект.ОтчетОПотоках Цикл
		
		Точка = ДиаграммаГантаИсполнения.УстановитьТочку(Строка.НомерПотока);

		Значение = ДиаграммаГантаИсполнения.ПолучитьЗначение(Точка, Серия);

		Интервал = Значение.Добавить();		

		Интервал.Начало = Строка.ВремяНачала;

		Интервал.Конец = Строка.ВремяОкончания;		
		
	КонецЦикла;
	
	ДиаграммаГантаИсполнения.Обновление = Истина;

КонецПроцедуры

#КонецОбласти


